app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }
        $model = new FormReg();
        $model2 = new FormPay();
        $model3 = new UserModel();
        $model4 = new Pendaftar();
        $jumlah_registrant = $model->countAllResults();
        $jumlah_receipt = $model2->countAllResults();
        $registrant = $model3->select('COUNT(users.user_id) AS jumlah, users.status AS kategori')->groupBy('users.status')->get();
---
SELECT COUNT(users.user_id) AS jumlah, `users`.`status` AS `kategori`
FROM `users`
GROUP BY `users`.`status`