app/Controllers/Latihan.php

SELECT *
FROM `pendaftaran`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `pendaftaran`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }
        $model = new Datareceipt();
        $currentPage = $this->request->getVar('page_pendaftaran') ? $this->request->getVar('page_pendaftaran') : 1;
        $check = $this->request->getVar('search');
        if (isset($check)) {
            $fetch = $this->request->getVar('keyword');
            session()->set('keyword7', $fetch);
        } else {
            $fetch = session()->get('keyword7');
        }
        $model->getProduct($fetch);
        $data = [
            'pendaftaran' => $model->getProduct()->getResult(),
            'pendaftaran' => $model->paginate(10, 'pendaftaran'),
            'pager' => $model->pager,
            'validation' => \Config\Services::validation(),
            'encrypter' => \Config\Services::encrypter(),
            'currentPage' => $currentPage
        ];