app/Controllers/Login.php

SELECT *
FROM `help_info`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `help_info`
---
    public function index()
    {
        if (session()->get('logged_in')) {
            return redirect()->to(base_url('/dashboard'));
        } else if (session()->get('logged_in2')) {
            return redirect()->to(base_url('/useracc'));
        } else if (session()->get('reset_password')) {
            return redirect()->to(base_url('/register/changepassword'));
        }
        $model2 = new Helpcent();
        helper('text');
        $check = $this->request->getVar('search');
        if (isset($check)) {
            $fetch = $this->request->getVar('keyword');
            session()->set('keyword2', $fetch);
        } else {
            $fetch = session()->get('keyword2');
        }
        $model2->getData($fetch);
        $data = [
            'help_info' => $model2->getData()->getResult(),
            'help_info' => $model2->paginate(6, 'help_info'),
            'pager' => $model2->pager,
            'encrypter' => \Config\Services::encrypter(),
            'validation' => \Config\Services::validation()
        ];

SELECT *
FROM `users`
WHERE `email` = 'ardeanreza7@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $rules = [
            'email2' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => "Don't forget to fill this",
                    'valid_email' => 'This is not a valid email'
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'provide a password'
                ]
            ]
        ];
        if ($this->validate($rules)) {
            $session = session();
            $model = new UserModel();
            $email = $this->request->getVar('email2');
            $password = $this->request->getVar('password');
            $data = $model->where('email', $email)->first();