app/Controllers/Modalboot.php

    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('/login'));
        }
        $model = new Datatablesmodal();
        $currentPage = $this->request->getVar('page_formulir_pendaftaran') ? $this->request->getVar('page_formulir_pendaftaran') : 1;
        $check = $this->request->getVar('search');
        if (isset($check)) {
            $fetch = $this->request->getVar('keyword');
            session()->set('keyword3', $fetch);
        } else {
            $fetch = session()->get('keyword3');
        }
        $model->getProduct($fetch);
        $data = [
            'formulir_pendaftaran' => $model->getProduct()->getResult(),
            'formulir_pendaftaran' => $model->paginate(10, 'formulir_pendaftaran'),
            'pager' => $model->pager,
            'encrypter' => \Config\Services::encrypter(),
            'validation' => \Config\Services::validation(),
            'currentPage' => $currentPage
        ];
---
SELECT *
FROM `formulir_pendaftaran`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `formulir_pendaftaran`