app/Models/Cryptograph.php

    public function getData()
    {
        $builder = $this->db->table('cryptool');
        return $builder->get();
---
SELECT *
FROM `cryptool`