app/Models/Datareceipt.php

SELECT *
FROM `pendaftaran`
---
    public function getProduct($fetch=null)
    {
        if ($fetch){
            return $this->table('pendaftaran')->like('email',$fetch)->orLike('inform',$fetch);
          }
        $this->table = 'pendaftaran';
        $builder = $this->db->table('pendaftaran');
        return $builder->get();