app/Models/Datatablesmodal.php

    public function getProduct($fetch=null)
    {
        if ($fetch){
            return $this->table('formulir_pendaftaran')->like('email',$fetch);
          }
        $this->table = 'formulir_pendaftaran';
        $builder = $this->db->table('formulir_pendaftaran');
        return $builder->get();
---
SELECT *
FROM `formulir_pendaftaran`