app/Models/Helpcent.php

    public function getData($fetch = null)
    {
        if ($fetch) {
            return $this->table('help_info')->like('title', $fetch)->orLike('category', $fetch);
        }
        $this->table = 'help_info';
        $builder = $this->db->table('help_info');
        return $builder->get();
---
SELECT *
FROM `help_info`